//+------------------------------------------------------------------+
//|                                                   OpenBenchmarks |
//|                   Copyright 2000-2020, MetaQuotes Software Corp. |
//|                                        http://www.metaquotes.net |
//+------------------------------------------------------------------+
#include <windows.h>

#define MAX_SIZE_RANDOM      10000
//+------------------------------------------------------------------+
//| 10. Random                                                       |
//+------------------------------------------------------------------+
#define IMR 139968
#define IAR 3877
#define ICR 29573
//+------------------------------------------------------------------+
//| Функция тестирования                                             |
//+------------------------------------------------------------------+
double TestRandom2(double max)
  {
   static long last=42;
//---
   last=(last*IAR+ICR)%IMR;
   return(max*last/IMR);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
UINT64 TestRandom(INT64 &result)
  {
   int    i,j;
   UINT64 ticks=GetTickCount64();
//--- тест
   result=0;
   for(i=0; i<MAX_SIZE_RANDOM; i++)
      for(j=0; j<MAX_SIZE_RANDOM; j++)
         result+=(INT64)TestRandom2(i+j);
//---
   return(GetTickCount64()-ticks);
  }
//+------------------------------------------------------------------+
